# #实现输入10个数字，并打印10个数的求和结果
# li=[1,2,3,4,5,6,7,8,9,10]
# s=0
# for i in li:
#     s=s+i
# print(s)
#
#
# #从键盘依次输入10个数，最后打印最大的数、10个数的和、和平均数。
# print("请依次输入10个数")
# a=input("")
# a=int(a)
# b=input("")
# b=int(b)
# c=input("")
# c=int(c)
# d=input("")
# d=int(d)
# e=input("")
# e=int(e)
# f=input("")
# f=int(f)
# g=input("")
# g=int(g)
# h=input("")
# h=int(h)
# i=input("")
# i=int(i)
# j=input("")
# j=int(j)
# li=[a,b,c,d,e,f,g,h,i,j]
# sum=0
# num=0
# Avg=0
# for i in li:
#     sum=sum+i
# for i in li:
#     if num<i:
#         num=i
# Avg=sum/10
# print("输入数字的和为",sum)
# print("最大值为",num)
# print("平均数为",Avg)
#




# 姓名  年龄  性别  编号   任职公司   薪资   部门编号
# names = [
#     ["曹操","56","男","106","IBM", 500 ,"50"],
#     ["大乔","19","女","230","微软", 501 ,"60"],
#     ["小乔", "19", "女", "210", "Oracle", 600, "60"],
#     ["许褚", "45", "男", "230", "Tencent", 700 , "10"]
# ]
# 1.统计每个人的平均薪资
# li=[500,501,600,700]
# Avg=0
# for i in range(0,4):
#     Avg=li[i]/4
# print(Avg)
# 2.统计每个人的平均年龄
# li=[56,19,19,45]
# Avg=0
# for i in range(0,4):
#     Avg=li[i]/4
# print(Avg)
# 3.公司新来一个员工，刘备，45，男，220，alibaba，500,30，添加到列表中
# names = [
#     ["曹操","56","男","106","IBM", 500 ,"50"],
#     ["大乔","19","女","230","微软", 501 ,"60"],
#     ["小乔", "19", "女", "210", "Oracle", 600, "60"],
#     ["许褚", "45", "男", "230", "Tencent", 700 , "10"],
#     ["刘备","45","男","220","alibaba",500,"30",],
# ]
# 4.统计公司男女人数


# 5.每个部门的人数


# #有下列列表，请编程实现列表的数据翻转
# alist = list(map(int, [1,2,3,4,5,6,7,8,9]))
# alist.reverse()
# print(alist)
#
#
#
# #有以下一个列表，求其中是5的倍数的和
# a = [1,5,21,30,15,9,30,24]
# s=0
# for i in a:
#     if i%5==0:
#         s=s+1
# print (s)
#
#
#
# #现在魔法学院有赫敏、哈利、罗恩、马尔福四个人的几次魔法作业的成绩。但是呢，因为有些魔法作业有一定难度，教授不强制同学们必须上交，所以大
# # 家上交作业的次数并不一致。
# # [罗恩, 23 ,35 ,44]
# # [哈利 ,60, 77 ,68 ,88, 90]
# # [赫敏, 97 ,99 ,89 ,91, 95, 90]
# # [马尔福 ,100, 85 ,90]
# # 求每个人的总成绩？
# s1=0
# list1=[23,35,44]
# for i in list1:
#     s1=s1+i
# print("罗恩的总成绩",s1)
# s2=0
# list2=[60, 77 ,68 ,88, 90]
# for i in list2:
#     s2=s2+i
# print("哈利的总成绩",s2)
# s3=0
# list3=[97 ,99 ,89 ,91, 95, 90]
# for i in list3:
#     s3=s3+i
# print("赫敏的总成绩",s3)
# s4=0
# list4=[100,85,90]
# for i in list4:
#     s4=s4+i
# print("马尔福的总成绩",s4)
#
#
#
#
# #用循环来实现20以内的数的阶乘。（1! +2!+3!+…..+20!）
# # res=1
# # for i in range(20,1,-1):
# #    res=i*res+1
# # print(res)
# h=0
# he=0
# for i in range(1,21):
#     if i == 1:
#         h=1
#         he=1
#     else:
#         h=i*h
#         he=he+h
# print(he)


#请编程统计列表中的每个数字出现的次数
List = [1,4,7,5,8,2,1,3,4,5,9,7,6,1,10]
s=dict()
for i in List:
    if i in s:
       s[i]=s[i]+1
    else:
        s[i]=1
print(s)
